// SPDX-License-Identifier: GPL-2.0+
/*
 * ASPEED FMC/SPI Controller driver
 *
 * Copyright (c) 2022 ASPEED Corporation.
 * Copyright (c) 2022 IBM Corporation.
 *
 * Author:
 *     Chin-Ting Kuo <chin-ting_kuo@aspeedtech.com>
 *     Cedric Le Goater <clg@kaod.org>
 */

#include <asm/io.h>
#include <clk.h>
#include <common.h>
#include <dm.h>
#include <dm/device_compat.h>
#include <linux/bitops.h>
#include <linux/bug.h>
#include <linux/err.h>
#include <linux/iopoll.h>
#include <linux/kernel.h>
#include <linux/mtd/spi-nor.h>
#include <linux/sizes.h>
#include <malloc.h>
#include <spi.h>
#include <spi-mem.h>
#include <inttypes.h>

#define ASPEED_SPI_MAX_CS       5

#define INTR_CTRL_DMA_STATUS	BIT(11)

#define CTRL_IO_SINGLE_DATA     0
#define CTRL_IO_QUAD_DATA       BIT(30)
#define CTRL_IO_DUAL_DATA       BIT(29)

#define CTRL_IO_MODE_USER       GENMASK(1, 0)
#define CTRL_IO_MODE_CMD_READ   BIT(0)
#define CTRL_IO_MODE_CMD_WRITE  BIT(1)
#define CTRL_STOP_ACTIVE        BIT(2)

#define DAM_CTRL_REQUEST	BIT(31)
#define DAM_CTRL_GRANT		BIT(30)
#define DMA_CTRL_CALIB		BIT(3)
#define DMA_CTRL_CKSUM		BIT(2)
#define DMA_CTRL_WRITE		BIT(1)
#define DMA_CTRL_ENABLE		BIT(0)

#define DMA_GET_REQ_MAGIC	0xaeed0000
#define DMA_DISCARD_REQ_MAGIC	0xdeea0000

#define TIMING_CAL_LEN		0x400

struct aspeed_spi_regs {
	u32 conf;                       /* 0x00 CE Type Setting */
	u32 ctrl;                       /* 0x04 CE Control */
	u32 intr_ctrl;                  /* 0x08 Interrupt Control and Status */
	u32 cmd_ctrl;                   /* 0x0c Command Control */
	u32 ce_ctrl[ASPEED_SPI_MAX_CS]; /* 0x10 .. 0x20 CEx Control */
	u32 _reserved0[3];              /* .. */
	u32 segment_addr[ASPEED_SPI_MAX_CS]; /* 0x30 .. 0x40 Segment Address */
	u32 _reserved1[3];		/* .. */
	u32 soft_rst_cmd_ctrl;          /* 0x50 Auto Soft-Reset Command Control */
	u32 _reserved2[11];             /* .. */
	u32 dma_ctrl;                   /* 0x80 DMA Control/Status */
	u32 dma_flash_addr;             /* 0x84 DMA Flash Side Address */
	u32 dma_dram_addr;              /* 0x88 DMA DRAM Side Address */
	u32 dma_len;                    /* 0x8c DMA Length Register */
	u32 dma_checksum;               /* 0x90 Checksum Calculation Result */
	u32 timings[ASPEED_SPI_MAX_CS]; /* 0x94 Read Timing Compensation */
};

struct aspeed_spi_plat {
	u8 max_cs;
	uintptr_t ahb_base; /* AHB address base for all flash devices. */
	fdt_size_t ahb_sz; /* Overall AHB window size for all flash device. */
	u32 hclk_rate; /* AHB clock rate */
};

enum aspeed_spi_cmd_mode {
	CMD_USER_MODE,
	CMD_READ_MODE,
	CMD_WRITE_MODE,
	CMD_MODE_MAX,
};

struct aspeed_spi_flash {
	uintptr_t ahb_base;
	size_t ahb_decoded_sz;
	u32 cmd_mode[CMD_MODE_MAX];
	u32 max_freq;
};

struct aspeed_spi_priv {
	u32 num_cs;
	struct aspeed_spi_regs *regs;
	struct aspeed_spi_info *info;
	struct aspeed_spi_flash flashes[ASPEED_SPI_MAX_CS];
	u8 *tmp_buf;
	bool fixed_decoded_range;
	bool disable_calib;
	bool pure_spi_mode_only;
};

struct aspeed_spi_info {
	u32 io_mode_mask;
	u32 max_bus_width;
	size_t min_decoded_sz;
	u32 clk_ctrl_mask;
	u32 hdiv_max;
	void (*set_4byte)(struct udevice *bus, u32 cs);
	uintptr_t (*segment_start)(struct udevice *bus, u32 reg);
